LiujiaHuan/Hardware/esp8266/Turn_on_off_LED.cpp
/**********************************************************************
项目名称/Project          : 零基础入门学用物联网
程序名称/Program name     : 3_2_2_Turning_on_and_off_an_LED
团队/Team                : 太极创客团队 / Taichi-Maker (www.taichi-maker.com)
作者/Author              : CYNO朔
日期/Date（YYYYMMDD）     : 20191108
程序目的/Purpose          : 使用NodeMCU建立基本服务器。用户可通过浏览器使用8266的IP地址
                           访问8266所建立的基本网页并通过该页面点亮/熄灭NodeMCU的内置LED
-----------------------------------------------------------------------
修订历史/Revision History  
日期/Date    作者/Author      参考号/Ref    修订说明/Revision Description
***********************************************************************/
#include <ESP8266WiFi.h>        // 本程序使用 ESP8266WiFi库
#include <ESP8266WiFiMulti.h>   //  ESP8266WiFiMulti库
#include <ESP8266WebServer.h>   //  ESP8266WebServer库
 
ESP8266WiFiMulti wifiMulti;     //创建WiFiMuti对象
ESP8266WebServer esp_8266_server(80);   //创建 WebServer对象    监听端口80

void setup(void){
    Serial.begin(9600)          //启动串口通信并设定指定速率
    pinMode(LED_BUILTIN, OUTPUT)//将LED_BUILTIN引脚设置为输出

    wifiMulti.addAP("ssid_from_AP_1", "your_password_for_AP_1"); // 将需要连接的一系列WiFi ID和密码输入这里
    wifiMulti.addAP("ssid_from_AP_2", "your_password_for_AP_2"); // ESP8266-NodeMCU再启动后会扫描当前网络
    wifiMulti.addAP("ssid_from_AP_3", "your_password_for_AP_3"); // 环境查找是否有这里列出的WiFi ID。如果有
    Serial.println("Connecting ...");                            // 则尝试使用此处存储的密码进行连接。
    
    int i = 0;
    while (wifiMulti.run() != WL_CONNECTED) {     // 此处的wifiMulti.run()是重点。通过wifiMulti.run()，NodeMCU将会在当前
        delay(1000);                             // 环境中搜索addAP函数所存储的WiFi。如果搜到多个存储的WiFi那么NodeMCU
        Serial.print(i++); Serial.print(' ');    // 将会连接信号最强的那一个WiFi信号。
    }                                            // 一旦连接WiFI成功，wifiMulti.run()将会返回“WL_CONNECTED”。这也是
                                                 // 此处while循环判断是否跳出循环的条件。
    
    //链接成功之后通过串口监视器输出连接成功信息
    Serial.println('\n');
    Serial.print("Connected to ");
    Serial.println(WiFi.SSID());              // 通过串口监视器输出连接的WiFi名称
    Serial.print("IP address:\t");
    Serial.println(WiFi.localIP());           // 通过串口监视器输出ESP8266-NodeMCU的IP

    esp8266_server.begin();                    //启动网站服务
    esp8266_server.on("/", HTTP_GET, handleRoot);//设置 调用服务器根目录函数 handleRoot
    esp8266_server.on("/LED", HTTP_POST, handleLED); //设置 处理LED控制请求函数
    esp8266_server.onNotFound(handleNotFound);         //设置 处理404的函数

    Serial.println("HTTP esp8266_server started");//提示
}
void loop(void){
    esp8266_server.handleClient();              //持续检查是否有访问
}
/*设置服务器根目录即'/'的函数'handleRoot'
  该函数的作用是每当有客户端访问NodeMCU服务器根目录时，
  NodeMCU都会向访问设备发送 HTTP 状态 200 (Ok) 这是send函数的第一个参数。
  同时NodeMCU还会向浏览器发送HTML代码，以下示例中send函数中第三个参数，
  也就是双引号中的内容就是NodeMCU发送的HTML代码。该代码可在网页中产生LED控制按钮。 
  当用户按下按钮时，浏览器将会向NodeMCU的/LED页面发送HTTP请求，请求方式为POST。
  NodeMCU接收到此请求后将会执行handleLED函数内容*/


void handleRoot(){//根目录访问
    esp8266_server.send(200, "text.html", "<form action=\"/LED\" method=\"POST\"><input type=\"submit\" value=\"Toggle LED\"></form>")
}

void handleLED(){//收到post参数以后，通过esp8266_server.on跳转到handeLED函数
    digitalWrite(LED_BUILTIN,!digitalRead(LED_BUILTIN)) //控制引脚输出高低电平,这里的作用就是LED灯变化状态

    /*形式：digitalWrite（pin，value）

    参数：pin：要操作的引脚；

    value：有HIGH和LOW两个取值。*/
}

void handleNotFound(){//404结果
  esp8266_server.send(404, "text/plain", "404: Not found"); // 发送 HTTP 状态 404 (未找到页面) 并向浏览器发送文字 "404: Not found"
}
